// ===== 博客数据 =====
window.articlesList = window.articlesList || [];
window.articlesList.push({
    id: 201,
    title: '永亭赋',
    category: 'poems',
    date: '2025-12-17 晚上',
    author: 'aromeslagol',
    readTime: 1,
    content: `
        <p>残霞退散日沉底，寒月照影人影稀。<br>群鸟掠空叶飘零。星映车马行。</p>
        <p>道岔忽现池南路，斜桥兀立水光银。<br>心引舟车至茂林。狭黯非迎宾。</p>
        <p>二更野静钟鼓响，众生无眠守空房。<br>听风水起潮落涨。诉家短情长。</p>       
        <p>永亭荒僻府门摇，溪清回环且盘绕。<br>宅邸四墙耸胜云，度日至终老。</p>        
        <p>望屋梢草履檐牙，观楼院钩心斗角。<br>虫蛾围灯火苗旺，竹柏声潇潇。</p>        
        <p>小巷偏远古井深，和风拂柳柳色青。<br>少女戏逐花间地，欢歌满郊庭。</p>        
        <p>幽径偶通山寺门，古佛静立香烟轻。<br>磬钟随意入禅林。净心远俗尘。</p>        
        <p>秋苇疏落沿河湾，夏林阴浓遮远城。<br>春柳垂姿歌复舞，絮烟花繁盛。</p>   
        <p>长河冻封舟楫停，笠翁收网叹伶仃。<br>祈盼冰融春景明。鱼水交相映。</p>   
        <p>白首翁妪围炉坐，闲话昔日岁月沉。<br>幼童不解其中味，嬉笑闹纷纷。</p>   
        <p>梨花乱舞掩陋舍，围毡煮酒意醺醺。<br>作画吟诗消长夜，不觉至清晨。</p>   
        <p>孤塘冷冽冰欲成，坐卧庭木身不起。<br>霜冻雪频侵寝席。荒草送白衣。</p>   
        <p>万枝枯落迎雪坠，裹衣徐行仍跌足。<br>世间人语寒彻骨。寻梅满院簇.</p> 
    `
}, {
    id: 202,
    title: '雪里行',
    category: 'poems',
    date: '2024-12-27 傍晚',
    author: 'aromeslagol',
    readTime: 1,
    content: `
        <p>天边雪兮人间木，木尽枯兮雪无数。<br>数见雾浓霜升树，树抽新芽为冰凌。<br>凌寒矮松常傍路，路狭车缓马不行。<br>行道三里察四近，近旁荒败无鸟鸣。<p>
        <p>鸣禽狗走村空落，落影孤村少行人。<br>人到溪边冰塞渡，渡头不见舟楫停。<br>停步长眺山峦处，处有幽林鸟不惊。<br>惊飙振壑枝难静，静立残垣听雪声。</p>
        <p>声段人绝风自呼，呼号旷野意何孤。<br>孤影徘徊寻暖处，处是残垣不见炉。<br>炉灰早冷屋倾颓，颓壁残墙乱草铺。<br>铺遍旧宅无人顾，顾盼难寻旧酒垆。</p>
        <p>垆边空有盏残存，存念悠悠岁月吞。<br>吞声忍泪心犹念，念及故交已没魂。<br>魂归不见旧时路，路断难通昔日村。<br>村墟寂寂炊烟灭，灭迹只余风破门。</p>
        <p>门掩寒光风愈怒，怒卷残雪落阶尘。<br>尘积旧忆迷望眼，眼穿不见彼年春。<br>春景难寻愁满腑，腑内幽思乱梦魂。<br>魂梦相牵归故地，地荒唯剩月相温。</p>
    `
});
